DiplomD/src/Documents/ПланПроведенияПромежуточнойАттестации/ПланПроведенияПромежуточнойАттестации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланПроведенияПромежуточнойАттестации</name>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильОбучения</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДисциплины</name>
    <type>
      <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодСессии</name>
    <type>
      <types>CatalogRef.ПланСдачиСессии</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСеметраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецСеместраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>EnumRef.ВидыромежуточнойАттестации</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Enums/ВидыромежуточнойАттестации/ВидыромежуточнойАттестации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыромежуточнойАттестации</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
</mdclass:Enum>

DiplomD/src/Documents/ФормированиеУчебныхГрупп/ФормированиеУчебныхГрупп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеУчебныхГрупп</name>
  <attributes>
    <name>НомерГруппы</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокСтудентов</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчислен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланОбучения</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.РабочаяПрограммаДисцилины</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>EnumRef.АттестационныеМероприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Documents/ПромежуточнаяАттестация/ПромежуточнаяАттестация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПромежуточнаяАттестация</name>
  <registerRecords>AccumulationRegister.РейтингСтудентов</registerRecords>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.РабочаяПрограммаДисцилины</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильНаправления</name>
    <type>
      <types>CatalogRef.ПрофилиНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДисциплины</name>
    <type>
      <types>CatalogRef.ОбъемыПромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАттестации</name>
    <type>
      <types>EnumRef.ВидыромежуточнойАттестации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.ПреподавательскийСостав</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.СписокСтудентов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗачетнойКнижки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БаллПромежуточнойАттестации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DiplomD/src/Catalogs/РабочаяПрограммаДисцилины/РабочаяПрограммаДисцилины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РабочаяПрограммаДисцилины</name>
  <tabularSections>
    <name>ТекущийКонтроль</name>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПреподавательскийСостав</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ПреподавательскийСостав</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПромежуточнаяАттестация</name>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидПромежуточнойАттестации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аттестация</name>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбразовательнаяПрограмма</name>
      <type>
        <types>CatalogRef.ОбразовательныеПрограммы</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаОбучения</name>
      <type>
        <types>CatalogRef.ФормыОбучения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрофильНаправления</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАттестации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DiplomD/src/Catalogs/ОбъемыПромежуточнойАттестации/ОбъемыПромежуточнойАттестации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъемыПромежуточнойАттестации</name>
  <attributes>
    <name>МаксКолБаллов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Незачтено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зачтено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Четыре</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пять</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматЗачтено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматХорошоОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматХорошоДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматОтлично</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТестов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРейтинговыхРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Catalogs/ПланСдачиСессии/ПланСдачиСессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланСдачиСессии</name>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНачалаСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОкончанияСессии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСеметраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецСеместраДляТестов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomD/src/Documents/ПланПроведенияПромежуточнойАттестации/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ТЧДатаПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧДатаПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	Если Стр.Дата > Объект.ДатаОкончанияСессии ИЛИ Стр.Дата < Объект.ДатаНачалаСессии Тогда 
		Сообщить("Дата проведения аттестационного мероприятия не может быть больше даты окончания сессии и меньше даты начала сессии"); 
		Стр.Дата = ""; 
	КонецЕсли; 
	
	ТЧДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ТЧПреподавательПриИзмененииНаСервере(Препод,Ведет)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочаяПрограммаДисцилиныПреподавательскийСостав.НомерСтроки КАК НомерСтроки,
	               |	РабочаяПрограммаДисцилиныПреподавательскийСостав.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.РабочаяПрограммаДисцилины.ПреподавательскийСостав КАК РабочаяПрограммаДисцилиныПреподавательскийСостав
	               |ГДЕ
	               |	РабочаяПрограммаДисцилиныПреподавательскийСостав.Ссылка = &Ссылка
	               |	И РабочаяПрограммаДисцилиныПреподавательскийСостав.Преподаватель = &Преподаватель";
	Запрос.УстановитьПараметр("Ссылка",Объект.Дисциплина); 
	Запрос.УстановитьПараметр("Преподаватель",Препод); 
	Рез = Запрос.Выполнить().Выбрать(); 
	Рез.Следующий(); 
	Если НЕ ПустаяСтрока(Рез.Ссылка) Тогда 
		Ведет = 1; 
	Иначе 
		Ведет = 0; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПреподавательПриИзменении(Элемент)
	Стр = Элементы.ТЧ.ТекущиеДанные; 
	Препод = Стр.Преподаватель; 
	Ведет = 0; 
	ТЧПреподавательПриИзмененииНаСервере(Препод,Ведет);
	Если Ведет = 0 Тогда 
		Сообщить("Выбранный преподаватель не ведет дисцилину" + " " + Объект.Дисциплина); 
		Стр.преподаватель = "";
	КонецЕсли; 
	
	
КонецПроцедуры

&НаСервере
Процедура ДисциплинаПриИзмененииНаСервере()
     Запросоиск = Новый Запрос; 
	 Запросоиск.Текст = "ВЫБРАТЬ
	                    |	ФормированиеУчебныхГруппПланОбучения.КоличествоЧасов КАК КоличествоЧасов
	                    |ИЗ
	                    |	Документ.ФормированиеУчебныхГрупп.ПланОбучения КАК ФормированиеУчебныхГруппПланОбучения
	                    |ГДЕ
	                    |	ФормированиеУчебныхГруппПланОбучения.Дисциплина = &Дисциплина
	                    |	И ФормированиеУчебныхГруппПланОбучения.Ссылка.НомерГруппы = &НомерГруппы";
	
	 Запросоиск.УстановитьПараметр("Дисциплина",Объект.Дисциплина); 
	 Запросоиск.УстановитьПараметр("НомерГруппы",Объект.Группа); 
	 
	 Результат = Запросоиск.Выполнить().Выбрать(); 
	 Результат.Следующий(); 
	 
	 Если ПустаяСтрока(Результат.КоличествоЧасов) Тогда 
		 Сообщить("В плане обучения группы" + " " + Объект.Группа + " " + "не предусмотрена дисцилина" + " " + объект.Дисциплина); 
		Объект.Дисциплина = "";
	Иначе 
		
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	РабочаяПрограммаДисцилиныПромежуточнаяАттестация.ВидПромежуточнойАттестации КАК ВидПромежуточнойАттестации
	               |ИЗ
	               |	Справочник.РабочаяПрограммаДисцилины.ПромежуточнаяАттестация КАК РабочаяПрограммаДисцилиныПромежуточнаяАттестация
	               |ГДЕ
	               |	РабочаяПрограммаДисцилиныПромежуточнаяАттестация.Ссылка = &Ссылка
	               |	И РабочаяПрограммаДисцилиныПромежуточнаяАттестация.ПрофильНаправления = &ПрофильНаправления
	               |	И РабочаяПрограммаДисцилиныПромежуточнаяАттестация.Семестр = &Семестр";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Дисциплина); 
	Запрос.УстановитьПараметр("ПрофильНаправления",Объект.ПрофильОбучения); 
	Запрос.УстановитьПараметр("Семестр",Объект.Семестр); 
	рез = Запрос.Выполнить().Выбрать(); 
	Рез.Следующий(); 
	
	Объект.ОбъемДисциплины = рез.ВидПромежуточнойАттестации; 
	
	Спр = Справочники.ОбъемыПромежуточнойАттестации.НайтиПоНаименованию(Объект.ОбъемДисциплины); 
	КолТ = Спр.КоличествоТестов; 
	КолРр = Спр.КоличествоРейтинговыхРабот; 
	
	Пока КолТ > 0 Цикл
		О = Объект.ТЧ.Добавить(); 
		О.ВидАттестации = перечисления.ВидыромежуточнойАттестации.тест; 
		КолТ = КолТ-1; 
		
	КонецЦикла; 
	  Пока КолРр > 0 Цикл
		О = Объект.ТЧ.Добавить(); 
		О.ВидАттестации = перечисления.ВидыромежуточнойАттестации.рейтинговаяРабота; 
		КолРр = КолРр-1; 
		
	КонецЦикла;  
	
	
КонецЕсли; 

	
КонецПроцедуры

&НаКлиенте
Процедура ДисциплинаПриИзменении(Элемент)
	ДисциплинаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодСессииПриИзмененииНаСервере()
	Спр = Справочники.ПланСдачиСессии.НайтиПоНаименованию(Объект.ПериодСессии); 
	Если НЕ Объект.ФормаОбучения = Спр.ФормаОбучения Тогда 
		Сообщить("неправильно выбран период сессии"); 
		Объект.ПериодСессии = "";   
	Иначе 
		Объект.Семестр = Спр.Семестр;
		Объект.ДатаНачалаСессии = Спр.ПериодНачалаСессии; 
		Объект.ДатаОкончанияСессии = Спр.периодОкончанияСессии; 
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСессииПриИзменении(Элемент)
	ПериодСессииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаПриИзмененииНаСервере()
	Спр = Справочники.Группы.НайтиПоНаименованию(Объект.Группа); 
	Объект.ФормаОбучения = Спр.ФормаОбучения; 
	Объект.ПрофильОбучения = Спр.ПрофильНаправления; 
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПриИзменении(Элемент)
	ГруппаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПромежуточнойАттестацииНаСервере()
		Если ПустаяСтрока(Объект.Номер) Тогда 
		Сообщить("Перед созданием документов необходимо провести План"); 
	Иначе 
		
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПромежуточнаяАттестация.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПромежуточнаяАттестация КАК ПромежуточнаяАттестация
	               |ГДЕ
	               |	ПромежуточнаяАттестация.Основание = &Основание";  
	Запрос.УстановитьПараметр("Основание",Объект.Ссылка);   
	рез = Запрос.Выполнить().Выгрузить(); 
	Если НЕ рез.Количество() = 0 тогда
		Сообщить("По данному плану ранее были созданы документы промежуточной аттестации"); 
	Иначе 
		Для каждого стр из Объект.ТЧ Цикл 
			Док = Документы.ПромежуточнаяАттестация.СоздатьДокумент(); 
			Док.Дата = ТекущаяДата(); 
			Док.Группа = Объект.Группа; 
			Док.ФормаОбучения = Объект.ФормаОбучения; 
			Док.ПрофильНаправления = Объект.ПрофильОбучения; 
			Док.ОбъемДисциплины = Объект.ОбъемДисциплины; 
			Док.ВидАттестации = Стр.ВидАттестации;
			Док.Основание = Объект.Ссылка; 
			Док.Преподаватель = Стр.Преподаватель; 
			Док.ДатаПроведения = Стр.Дата;  
			Док.Дисциплина = Объект.Дисциплина; 
			Док.Семестр = объект.Семестр; 
			
			ЗапросГруп = Новый Запрос; 
			ЗапросГруп.Текст = "ВЫБРАТЬ
			                   |	ФормированиеУчебныхГруппСписокСтудентов.Студент КАК Студент,
			                   |	ФормированиеУчебныхГруппСписокСтудентов.НомерЗачетнойКнижки КАК НомерЗачетнойКнижки
			                   |ИЗ
			                   |	Документ.ФормированиеУчебныхГрупп.СписокСтудентов КАК ФормированиеУчебныхГруппСписокСтудентов
			                   |ГДЕ
			                   |	ФормированиеУчебныхГруппСписокСтудентов.Ссылка.НомерГруппы = &НомерГруппы";
			
	ЗапросГруп.УстановитьПараметр("НомерГруппы",Объект.Группа); 
	Результ = ЗапросГруп.Выполнить().Выгрузить(); 
	Для каждого строк из Результ Цикл 
	А = Док.ТЧ.Добавить(); 
	А.Студент = Строк.Студент; 
	А.НомерЗачетнойКнижки = Строк.НомерЗачетнойКнижки; 
		
КонецЦикла;

Попытка
	Док.Записать(РежимЗаписиДокумента.Запись); 
	Док.Записать(РежимЗаписиДокумента.Проведение); 
	Сообщить("Создан документ промежуточной аттестации"); 
Исключение 
	Сообщить("Документ промежуточной аттестации НЕ создан"); 
КонецПопытки; 

	
		КонецЦикла; 
		
		
	КонецЕсли; 
	
		
		
	
	
	
	
КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПромежуточнойАттестации(Команда)
	СоздатьДокументыПромежуточнойАттестацииНаСервере();
КонецПроцедуры
